# Power Products Lab

### Introduction

In this lesson, let's stick with our dataset of working with transaction data.  However, instead use our cumulative percentage to determine our power products.

Let's write a query to calculate the running total of revenue brought in by product.

### Loading our data

In [1]:
import warnings
warnings.simplefilter(action='ignore')
import pandas as pd
url = "https://raw.githubusercontent.com/analytics-engineering-jigsaw/data-visualization/main/2-storytelling/1-what-to-focus-on/ecommerce-dataset.csv"

transasctions_df = pd.read_csv(url, index_col = 0)
transasctions_df[:2]

,Transaction_id,customer_id,Date,Product,Gender,Device_Type,Country,State,City,Category,Customer_Login_type,Delivery_Type,Quantity,Transaction Start,Transaction_Result,Amount US$,Individual_Price_US$,Year_Month,Time
0,40170,1348959766,14/11/2013,Hair Band,Female,Web,United States,New York,New York City,Accessories,Member,one-day deliver,12,1,0,"6,910",576,13-Nov,22:35:51
1,33374,2213674919,05/11/2013,Hair Band,Female,Web,United States,California,Los Angles,Accessories,Member,one-day deliver,17,1,1,"1,699",100,13-Nov,06:44:41

So we have our original dataset.

### Cleaning the data

And remember that the `'Amount US$'` is the total amount spent in a given checkout.  So start by cleaning that amount, turning it into a number, and then adding a new column to the dataframe called `amount_spent`.

In [10]:
total_amount = pd.to_numeric(transasctions_df['Amount US$'].str.replace(',', ''))
# total_amount[:3]

In [9]:
updated_txn_df = transasctions_df.assign(amount_spent = total_amount)
updated_txn_df['amount_spent'][:3]

# 0    6910.0
# 1    1699.0
# 2    4998.0
# Name: amount_spent, dtype: float64

0    6910.0
1    1699.0
2    4998.0
Name: amount_spent, dtype: float64

### Grouping by product

Ok, so now let's produce the following cumulative percent dataframe.

<img src="./product-grouped.png" width="50%">

So we can see from the above, that the top five products account for almost 90 percent of our revenue.  And two products account for 60% of revenue.  Seems like we better learn a lot about face creams and shirts.

### Analyzing the data

So next it's time to analyze this subset of the data.  So get back to the original dataframe, and just select those records related to Fairness Cream and shirts.

In [24]:
updated_txn_df[:2]

,Transaction_id,customer_id,Date,Product,Gender,Device_Type,Country,State,City,Category,Customer_Login_type,Delivery_Type,Quantity,Transaction Start,Transaction_Result,Amount US$,Individual_Price_US$,Year_Month,Time,amount_spent
0,40170,1348959766,14/11/2013,Hair Band,Female,Web,United States,New York,New York City,Accessories,Member,one-day deliver,12,1,0,"6,910",576,13-Nov,22:35:51,6910.0
1,33374,2213674919,05/11/2013,Hair Band,Female,Web,United States,California,Los Angles,Accessories,Member,one-day deliver,17,1,1,"1,699",100,13-Nov,06:44:41,1699.0

> Please do this by using the `loc` method.

In [3]:
# 

power_product_txns = None
# power_product_txns[:2]

# 	Transaction_id	customer_id	Date	Product	Gender	Device_Type	Country	State	City	Category	Customer_Login_type	Delivery_Type	Quantity	Transaction Start	Transaction_Result	Amount US$	Individual_Price_US$	Year_Month	Time	amount_spent
# Product																				
# Fairness Cream	25926	1470913235	24/10/2013	Fairness Cream	Female	Web	United States	New York	New York City	Fashion	Member	one-day deliver	15	1	1	0	0	13-Oct	15:25:17	0.0
# Fairness Cream	26380	1576274140	25/10/2013	Fairness Cream	Female	Web	United States	New York	New York City	Fashion

And also select the non-power product txns.

In [4]:
non_power_product_txns = None

# non_power_product_txns[:2]

# 	Transaction_id	customer_id	Date	Product	Gender	Device_Type	Country	State	City	Category	Customer_Login_type	Delivery_Type	Quantity	Transaction Start	Transaction_Result	Amount US$	Individual_Price_US$	Year_Month	Time	amount_spent
# Product																				
# Bag	27770	1438207607	28/10/2013	Bag	Female	Mobile	United States	New York	New York City	Fashion	Member	one-day deliver	20	1	1	4,840	242	13-Oct	08:41:19	4840.0
# Bag	29188	2047555294	30/10/2013	Bag	Female	Mobile	United States	New York	New York City	Fashion	Member	one-day deliver	17	1	1	437	26	13-Oct	21:17:16	437.0

### Plotting the data

Ok, so now we can use our build_and_print function to see if there are any differences between our products and our non_power_products.  We organized the different features into groups.

In [62]:
customer_cols = ['Gender', 'City'] # 'State'

time_cols = ['month', 'week', 'dow', 'hour']

product_cols = ['Product', 'Category', 'individual_price']

channel_cols = ['Device_Type', 'Customer_Login_type', 'Delivery_Type']

transaction_cols = ['transaction_id', 'quantity', 'transaction_start', 'transaction_result']

So begin by plotting how our power_products breakdown by our `customer_cols`.  Then see how the `non_power_products` plot for the `customer_cols`.

In [ ]:
from item_lib import *

power_products_customers = None

> Remember that our `build_and_print` function returns a dictionary of dataframes.  So we can dig deeper into each one.

In [71]:
power_products_customers.keys()

dict_keys(['Gender', 'City'])

In [70]:
power_products_customers['Gender']

          sum
Gender
Male    0.652
Female  0.348

In [72]:
power_products_customers['City']

                 sum
City
Seattle        0.638
Los Angles     0.312
New York City  0.050

Ok, now see our `non_power_product_txns` breakdown by our customer columns.

* Channel columns

Then follow the same procedure for channel columns.  See how the `power_product_txns` perform and how the `non_power_product_txns` breakdown by `channel_cols`.

> Power product txns

In [6]:
from item_lib import *

power_products_channels = None

> Non power product txns

In [8]:
from item_lib import *

power_products_channels = None

So looking at the above breakdowns, it looks like that our purchases of our power products:
    
* Tend to be more male
* Exclusively purchase through the web

From here, we could even look more deeply at our data.  For example, we can look at the top products individually to see how they breakdown, and why they perform so well.

### Summary

In this lesson we practiced using our 80 20 principle to create a cumulative percentage -- and then comparing the items in that top group, with those that fall outside of the group.

We did so by first grouping, summing and sorting our data.  And then using the `cumsum` function to create a cumulative sum of our data.

### Bonus

* finding the cumulative percentage with window functions in SQL

In [9]:
import pandas as pd

query = """with  product_spend as (
    select product, sum(amount) as total_amount 
    from transactions where amount is not null
    group by product
    order by total_amount desc),
    product_running_total as (
    select product, total_amount,
    sum(total_amount) over (order by total_amount desc) as running_total,
    sum(total_amount) over () as total_spend
    from product_spend)
    select product, total_amount, running_total/total_spend as percentage_spend from product_running_total;
    """

product_percentage_spend = pd.read_sql(query, engine)
product_percentage_spend

              product  total_amount  percentage_spend
0      Fairness Cream   105504507.0          0.351122
1               Shirt    75400880.0          0.602058
2                Jean    35546772.0          0.720359
3          spectacles    25493724.0          0.805203
4               Shoes    23154294.0          0.882261
5               Books    17438460.0          0.940297
6                 Bag    10069168.0          0.973807
7   watNew York Citys     7580836.0          0.999036
8           Hair Band      184642.0          0.999651
9             vessels       72061.0          0.999891
10          Pen Drive       27557.0          0.999982
11              Cycle        5299.0          1.000000

It seems that we can really just focus on a few products.

### Finding Characteristics

Next, in the cells below, go through the steps of identifying just the transactions involving the first three products.  Save those `power_product_transactions` as a table.  And then use the group by function to perform analysis on those products.